<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>15.5. Match</title><link rel="stylesheet" href="docbook-xsl.css" type="text/css" /><meta name="generator" content="DocBook XSL Stylesheets V1.75.2" /><link rel="home" href="index.html" title="The Neo4j Manual v1.6.1" /><link rel="up" href="cypher-query-lang.html" title="Chapter 15. Cypher Query Language" /><link rel="prev" href="query-start.html" title="15.4. Start" /><link rel="next" href="query-where.html" title="15.6. Where" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 4. Using Neo4j embedded in Java applications" /><link rel="chapter" href="cypher-cookbook.html" title="Chapter 5. Cypher Cookbook" /><link rel="chapter" href="tutorials-rest.html" title="Chapter 6. Using the Neo4j REST API" /><link rel="chapter" href="server-extending.html" title="Chapter 7. Extending the Neo4j Server" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 8. The Traversal Framework" /><link rel="chapter" href="domain-modeling-gallery.html" title="Chapter 9. Domain Modeling Gallery" /><link rel="chapter" href="languages.html" title="Chapter 10. Languages" /><link rel="chapter" href="tutorials-python-embedded.html" title="Chapter 11. Using Neo4j embedded in Python applications" /><link rel="part" href="reference-documentation.html" title="Part III. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 12. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 13. Transaction Management" /><link rel="chapter" href="indexing.html" title="Chapter 14. Indexing" /><link rel="chapter" href="cypher-query-lang.html" title="Chapter 15. Cypher Query Language" /><link rel="chapter" href="graph-algo.html" title="Chapter 16. Graph Algorithms" /><link rel="chapter" href="server.html" title="Chapter 17. Neo4j Server" /><link rel="chapter" href="rest-api.html" title="Chapter 18. REST API" /><link rel="chapter" href="python-embedded.html" title="Chapter 19. Python embedded bindings" /><link rel="part" href="operations.html" title="Part IV. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 20. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 21. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 22. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 23. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 24. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 25. Monitoring" /><link rel="part" href="tools.html" title="Part V. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 26. Web Administration" /><link rel="chapter" href="shell.html" title="Chapter 27. Neo4j Shell" /><link rel="part" href="community.html" title="Part VI. Community" /><link rel="chapter" href="community-support.html" title="Chapter 28. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 29. Contributing to Neo4j" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-shell" /><link rel="refentry" href="re03.html" title="neo4j-coordinator" /><link rel="refentry" href="re04.html" title="neo4j-coordinator-shell" /><link rel="appendix" href="questions.html" title="Appendix B. Questions &amp; Answers" /><link rel="subsection" href="query-match.html#match-related-nodes" title="15.5.1. Related nodes" /><link rel="subsection" href="query-match.html#match-outgoing-relationships" title="15.5.2. Outgoing relationships" /><link rel="subsection" href="query-match.html#match-directed-relationships-and-identifier" title="15.5.3. Directed relationships and identifier" /><link rel="subsection" href="query-match.html#match-match-by-relationship-type" title="15.5.4. Match by relationship type" /><link rel="subsection" href="query-match.html#match-match-by-relationship-type-and-use-an-identifier" title="15.5.5. Match by relationship type and use an identifier" /><link rel="subsection" href="query-match.html#match-relationship-types-with-uncommon-characters" title="15.5.6. Relationship types with uncommon characters" /><link rel="subsection" href="query-match.html#match-multiple-relationships" title="15.5.7. Multiple relationships" /><link rel="subsection" href="query-match.html#match-variable-length-relationships" title="15.5.8. Variable length relationships" /><link rel="subsection" href="query-match.html#match-relationship-identifier-in-variable-length-relationships" title="15.5.9. Relationship identifier in variable length relationships" /><link rel="subsection" href="query-match.html#match-zero-length-paths" title="15.5.10. Zero length paths" /><link rel="subsection" href="query-match.html#match-optional-relationship" title="15.5.11. Optional relationship" /><link rel="subsection" href="query-match.html#match-optional-typed-and-named-relationship" title="15.5.12. Optional typed and named relationship" /><link rel="subsection" href="query-match.html#match-properties-on-optional-elements" title="15.5.13. Properties on optional elements" /><link rel="subsection" href="query-match.html#match-complex-matching" title="15.5.14. Complex matching" /><link rel="subsection" href="query-match.html#match-shortest-path" title="15.5.15. Shortest path" /><link rel="subsection" href="query-match.html#match-all-shortest-paths" title="15.5.16. All shortest paths" /><link rel="subsection" href="query-match.html#match-named-path" title="15.5.17. Named path" /><link rel="subsection" href="query-match.html#match-matching-on-a-bound-relationship" title="15.5.18. Matching on a bound relationship" /><link rel="copyright" href="ln-id522301.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="reference-documentation.html">Reference</a></span> &gt; <span class="breadcrumb-link"><a href="cypher-query-lang.html">Cypher Query Language</a></span> &gt; <span class="breadcrumb-node">Match</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="query-start.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="query-where.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="query-match"></a>15.5. Match</h2></div></div></div><div class="toc"><dl><dt><span class="section"><a href="query-match.html#match-related-nodes">15.5.1. Related nodes</a></span></dt><dt><span class="section"><a href="query-match.html#match-outgoing-relationships">15.5.2. Outgoing relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-directed-relationships-and-identifier">15.5.3. Directed relationships and identifier</a></span></dt><dt><span class="section"><a href="query-match.html#match-match-by-relationship-type">15.5.4. Match by relationship type</a></span></dt><dt><span class="section"><a href="query-match.html#match-match-by-relationship-type-and-use-an-identifier">15.5.5. Match by relationship type and use an identifier</a></span></dt><dt><span class="section"><a href="query-match.html#match-relationship-types-with-uncommon-characters">15.5.6. Relationship types with uncommon characters</a></span></dt><dt><span class="section"><a href="query-match.html#match-multiple-relationships">15.5.7. Multiple relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-variable-length-relationships">15.5.8. Variable length relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-relationship-identifier-in-variable-length-relationships">15.5.9. Relationship identifier in variable length relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-zero-length-paths">15.5.10. Zero length paths</a></span></dt><dt><span class="section"><a href="query-match.html#match-optional-relationship">15.5.11. Optional relationship</a></span></dt><dt><span class="section"><a href="query-match.html#match-optional-typed-and-named-relationship">15.5.12. Optional typed and named relationship</a></span></dt><dt><span class="section"><a href="query-match.html#match-properties-on-optional-elements">15.5.13. Properties on optional elements</a></span></dt><dt><span class="section"><a href="query-match.html#match-complex-matching">15.5.14. Complex matching</a></span></dt><dt><span class="section"><a href="query-match.html#match-shortest-path">15.5.15. Shortest path</a></span></dt><dt><span class="section"><a href="query-match.html#match-all-shortest-paths">15.5.16. All shortest paths</a></span></dt><dt><span class="section"><a href="query-match.html#match-named-path">15.5.17. Named path</a></span></dt><dt><span class="section"><a href="query-match.html#match-matching-on-a-bound-relationship">15.5.18. Matching on a bound relationship</a></span></dt></dl></div><p>In the match part of a query, the pattern is described. The description of the
pattern is made up of one or more paths, separated by commas.</p><p>Node identifiers can be used with or without surrounding parenthesis. These two match clauses are semantically identical:</p><p><code class="literal"><code class="literal">MATCH (a)--&gt;(b)</code></code></p><p>and</p><p><code class="literal"><code class="literal">MATCH a--&gt;b</code></code></p><p>All parts of the pattern must be directly or indirectly bound to a start point.</p><p>The optional relationship is a way to describe parts of the pattern that can evaluate to null if it can not be
matched to the real graph. It’s the equivalent of SQL outer join - if Cypher finds one or more matches, they will be
returned. If no matches are found, Cypher will return a null.</p><p>Optionality travels - if a part of the pattern can only be reached from a bound point through an optional relationship,
that part is also optional. Also, named paths that contain optional parts are also optional - if any part of the path is
null, the whole path is null.</p><p>In these example, b and p are all optional and can contain null:</p><p><code class="literal"><code class="literal">START a=node(1)</code></code>
<code class="literal"><code class="literal">MATCH p = a-[?]-&gt;b</code></code></p><p><code class="literal"><code class="literal">START a=node(1)</code></code>
<code class="literal"><code class="literal">MATCH p = a-[*?]-&gt;b</code></code></p><p><code class="literal"><code class="literal">START a=node(1)</code></code>
<code class="literal"><code class="literal">MATCH p = a-[?]-&gt;x--&gt;b</code></code></p><p><code class="literal"><code class="literal">START a=node(1), x=node(100)</code></code>
<code class="literal"><code class="literal">MATCH p = shortestPath( a-[*?]-&gt;x )</code></code></p><p><span class="emphasis"><em>Graph</em></span></p><div class="informalfigure"><a class="ulink" href="images/cypher-match-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypher-match-graph.svg" alt="cypher-match-graph.svg" /></span>
</a></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-related-nodes"></a>15.5.1. Related nodes</h3></div></div></div><p>The symbol <code class="literal">--</code> means related to, without regard to type or direction.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)--(x)
RETURN x</pre><p>All nodes related to A are returned</p><div class="queryresult table"><a id="id554812"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows, 1 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name-&gt;"Bossman"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name-&gt;"David"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name-&gt;"Cesar"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-outgoing-relationships"></a>15.5.2. Outgoing relationships</h3></div></div></div><p>When the direction of a relationship is interesting, it is shown by using <code class="literal">--&gt;</code> or <code class="literal">&lt;--</code>, like this:</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)--&gt;(x)
RETURN x</pre><p>All nodes that A has outgoing relationships to.</p><div class="queryresult table"><a id="id554927"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows, 0 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name-&gt;"Bossman"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name-&gt;"Cesar"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-directed-relationships-and-identifier"></a>15.5.3. Directed relationships and identifier</h3></div></div></div><p>If an identifier is needed, either for filtering on properties of the relationship, or to return the relationship, this is how you introduce the identifier.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)-[r]-&gt;()
RETURN r</pre><p>All outgoing relationships from node A.</p><div class="queryresult table"><a id="id555022"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows, 0 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:KNOWS[0] {}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">:BLOCKS[1] {}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-match-by-relationship-type"></a>15.5.4. Match by relationship type</h3></div></div></div><p>When you know the relationship type you want to match on, you can specify it by using a colon.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)-[:BLOCKS]-&gt;(x)
RETURN x</pre><p>All nodes that are BLOCKed by A.</p><div class="queryresult table"><a id="id555117"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">1 rows, 1 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name-&gt;"Cesar"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-match-by-relationship-type-and-use-an-identifier"></a>15.5.5. Match by relationship type and use an identifier</h3></div></div></div><p>If you both want to introduce an identifier to hold the relationship, and specify the relationship type you want, just add them both, like this.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)-[r:BLOCKS]-&gt;()
RETURN r</pre><p>All <code class="literal">BLOCKS</code> relationship going out from A.</p><div class="queryresult table"><a id="id555206"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">1 rows, 0 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:BLOCKS[1] {}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-relationship-types-with-uncommon-characters"></a>15.5.6. Relationship types with uncommon characters</h3></div></div></div><p>Sometime your database will have types with non-letter characters, or with spaces in them. Use ` to escape these.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START n=node(3)
MATCH (n)-[r:`TYPE WITH SPACE IN IT`]-&gt;()
RETURN r</pre><p>This returns a relationship of a type with spaces in it.</p><div class="queryresult table"><a id="id555290"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">1 rows, 0 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:TYPE WITH SPACE IN IT[6] {}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-multiple-relationships"></a>15.5.7. Multiple relationships</h3></div></div></div><p>Relationships can be expressed by using multiple statements in the form of <code class="literal">()--()</code>, or they can be strung together, like this:</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START a=node(3)
MATCH (a)-[:KNOWS]-&gt;(b)-[:KNOWS]-&gt;(c)
RETURN a,b,c</pre><p>The three nodes in the path.</p><div class="queryresult table"><a id="id555378"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /><col /><col /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">b</th><th align="left" valign="top">c</th></tr></thead><tfoot><tr><th colspan="3" align="left" valign="top">1 rows, 1 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name-&gt;"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{name-&gt;"Emil"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-variable-length-relationships"></a>15.5.8. Variable length relationships</h3></div></div></div><p>Nodes that are variable number of relationship→node hops can be found using <code class="literal">-[:TYPE*minHops..maxHops]-&gt;</code>.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START a=node(3), x=node(2, 4)
MATCH a-[:KNOWS*1..3]-&gt;x
RETURN a,x</pre><p>Returns the start and end point, if there is a path between 1 and 3 relationships away</p><div class="queryresult table"><a id="id555507"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /><col /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">2 rows, 1 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{name-&gt;"Emil"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name-&gt;"Bossman"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-relationship-identifier-in-variable-length-relationships"></a>15.5.9. Relationship identifier in variable length relationships</h3></div></div></div><p>When the connection between two nodes is of variable length, a relationship identifier becomes an iterable of relationships.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START a=node(3), x=node(2, 4)
MATCH a-[r:KNOWS*1..3]-&gt;x
RETURN r</pre><p>Returns the start and end point, if there is a path between 1 and 3 relationships away</p><div class="queryresult table"><a id="id555635"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows, 2 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">List(Relationship[0], Relationship[3])</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">List(Relationship[0])</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-zero-length-paths"></a>15.5.10. Zero length paths</h3></div></div></div><p>When using variable length paths that have the lower bound zero, it means that two identifiers can point to the same node. If the distance between two nodes is zero, they are, by definition, the same node.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START a=node(3)
MATCH p1=a-[:KNOWS*0..1]-&gt;b, p2=b-[:BLOCKS*0..1]-&gt;c
RETURN a,b,c, length(p1), length(p2)</pre><p>This query will return four paths, some of them with length zero.</p><div class="queryresult table"><a id="id555732"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /><col /><col /><col /><col /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">b</th><th align="left" valign="top">c</th><th align="left" valign="top">LENGTH(p1)</th><th align="left" valign="top">LENGTH(p2)</th></tr></thead><tfoot><tr><th colspan="5" align="left" valign="top">4 rows, 3 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">0</code></p></td><td align="left" valign="top"><p><code class="literal">0</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[5]{name-&gt;"Cesar"}</code></p></td><td align="left" valign="top"><p><code class="literal">0</code></p></td><td align="left" valign="top"><p><code class="literal">1</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name-&gt;"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name-&gt;"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">1</code></p></td><td align="left" valign="top"><p><code class="literal">0</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name-&gt;"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[1]{name-&gt;"David"}</code></p></td><td align="left" valign="top"><p><code class="literal">1</code></p></td><td align="left" valign="top"><p><code class="literal">1</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-optional-relationship"></a>15.5.11. Optional relationship</h3></div></div></div><p>If a relationship is optional, it can be marked with a question mark. This similar to how a SQL outer join works, if the relationship is there, it is returned. If it’s not, <code class="literal">null</code> is returned in it’s place. Remember that anything hanging of an optional relation, is in turn optional, unless it is connected with a bound node some other path.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START a=node(2)
MATCH a-[?]-&gt;x
RETURN a,x</pre><p>A node, and <code class="literal">null</code>, since the node has no relationships.</p><div class="queryresult table"><a id="id556066"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /><col /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 rows, 1 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name-&gt;"Emil"}</code></p></td><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-optional-typed-and-named-relationship"></a>15.5.12. Optional typed and named relationship</h3></div></div></div><p>Just as with a normal relationship, you can decide which identifier it goes into, and what relationship type you need.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START a=node(3)
MATCH a-[r?:LOVES]-&gt;()
RETURN a,r</pre><p>A node, and <code class="literal">null</code>, since the node has no relationships.</p><div class="queryresult table"><a id="id556174"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /><col /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 rows, 0 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-properties-on-optional-elements"></a>15.5.13. Properties on optional elements</h3></div></div></div><p>Returning a property from an optional element that is <code class="literal">null</code> will also return <code class="literal">null</code>.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START a=node(2)
MATCH a-[?]-&gt;x
RETURN x, x.name</pre><p>The element x (null in this query), and null as it’s name.</p><div class="queryresult table"><a id="id556287"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /><col /></colgroup><thead><tr><th align="left" valign="top">x</th><th align="left" valign="top">x.name</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 rows, 1 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-complex-matching"></a>15.5.14. Complex matching</h3></div></div></div><p>Using Cypher, you can also express more complex patterns to match on, like a diamond shape pattern.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START a=node(3)
MATCH (a)-[:KNOWS]-&gt;(b)-[:KNOWS]-&gt;(c), (a)-[:BLOCKS]-(d)-[:KNOWS]-(c)
RETURN a,b,c,d</pre><p>The four nodes in the path.</p><div class="queryresult table"><a id="id556391"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /><col /><col /><col /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">b</th><th align="left" valign="top">c</th><th align="left" valign="top">d</th></tr></thead><tfoot><tr><th colspan="4" align="left" valign="top">1 rows, 2 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name-&gt;"Anders"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[4]{name-&gt;"Bossman"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{name-&gt;"Emil"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[5]{name-&gt;"Cesar"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-shortest-path"></a>15.5.15. Shortest path</h3></div></div></div><p>Finding a single shortest path between two nodes is as easy as using the shortestPath-function, like this.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START d=node(1), e=node(2)
MATCH p = shortestPath( d-[*..15]-&gt;e )
RETURN p</pre><p>This means: find a single shortest path between two nodes, as long as the path is max 15 relationships long. Inside of the parenthesis
 you write a single link of a path - the starting node, the connecting relationship and the end node. Characteristics describing the relationship
 like relationship type, max hops and direction are all used when finding the shortest path. You can also mark the path as optional.</p><div class="queryresult table"><a id="id556538"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">1 rows, 1 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">(1)--[KNOWS,2]--&gt;(3)--[KNOWS,0]--&gt;(4)--[KNOWS,3]--&gt;(2)</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-all-shortest-paths"></a>15.5.16. All shortest paths</h3></div></div></div><p>Finds all the shortest paths between two nodes.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START d=node(1), e=node(2)
MATCH p = allShortestPaths( d-[*..15]-&gt;e )
RETURN p</pre><p>This will find the two directed paths between David and Emil.</p><div class="queryresult table"><a id="id556623"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows, 0 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">(1)--[KNOWS,2]--&gt;(3)--[KNOWS,0]--&gt;(4)--[KNOWS,3]--&gt;(2)</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">(1)--[KNOWS,2]--&gt;(3)--[BLOCKS,1]--&gt;(5)--[KNOWS,4]--&gt;(2)</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-named-path"></a>15.5.17. Named path</h3></div></div></div><p>If you want to return or filter on a path in your pattern graph, you can a introduce a named path.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START a=node(3)
MATCH p = a--&gt;b
RETURN p</pre><p>The two paths starting from the first node.</p><div class="queryresult table"><a id="id556719"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows, 1 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">(3)--[KNOWS,0]--&gt;(4)</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">(3)--[BLOCKS,1]--&gt;(5)</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-matching-on-a-bound-relationship"></a>15.5.18. Matching on a bound relationship</h3></div></div></div><p>When your pattern contains a bound relationship, and that relationship pattern doesn specify direction,
Cypher will try to match the relationship where the connected nodes switch sides.</p><p><span class="emphasis"><em>Query</em></span></p><pre class="programlisting brush: cypher">START a=node(3), b=node(2)
MATCH a-[?:KNOWS]-x-[?:KNOWS]-b
RETURN x</pre><p>This returns the two connected nodes, once as the start node, and once as the end node</p><div class="queryresult table"><a id="id556817"></a><p class="title"><b>Result</b></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows, 4 ms</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name-&gt;"Bossman"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name-&gt;"David"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name-&gt;"Cesar"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><HR xmlns=""></HR><a xmlns="" href="ln-id522301.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2012 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="query-start.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="cypher-query-lang.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="query-where.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
